# To Predict the salary using Linear regression in multivariable

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("C:\\users\\sameer\\Desktop\\Datasets\\hiring.csv")
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [3]:
data.describe()

       test_score(out of 10)  interview_score(out of 10)    salary($)
count               7.000000                    8.000000      8.00000
mean                7.857143                    7.875000  63000.00000
std                 1.345185                    1.642081  11501.55269
min                 6.000000                    6.000000  45000.00000
25%                 7.000000                    6.750000  57500.00000
50%                 8.000000                    7.500000  63500.00000
75%                 8.500000                    9.250000  70500.00000
max                10.000000                   10.000000  80000.00000

# Preprocessing

In [4]:
from word2number import w2n

In [ ]:
#pip install word2number

In [5]:
data.experience = data.experience.fillna('zero')
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [6]:
for i in range(len(data.experience)):
    data.experience[i] = w2n.word_to_num(data.experience[i])
data.head()

C:\Users\sameer\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2          5                    6.0                           7      60000
3          2                   10.0                          10      65000
4          7                    9.0                           6      70000

In [7]:
data.tail()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
3          2                   10.0                          10      65000
4          7                    9.0                           6      70000
5          3                    7.0                          10      62000
6         10                    NaN                           7      72000
7         11                    7.0                           8      80000

In [13]:
data.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [28]:
data.rename(columns = {'test_score(out of 10)' : 'test_score','interview_score(out of 10)':'interview_score','salary($)':'salary'},inplace = True)
data.head()

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000

In [29]:
data.describe()

       experience  test_score  interview_score       salary
count     8.00000    8.000000         8.000000      8.00000
mean      4.75000    7.875000         7.875000  63000.00000
std       4.26782    1.246423         1.642081  11501.55269
min       0.00000    6.000000         6.000000  45000.00000
25%       1.50000    7.000000         6.750000  57500.00000
50%       4.00000    8.000000         7.500000  63500.00000
75%       7.75000    8.250000         9.250000  70500.00000
max      11.00000   10.000000        10.000000  80000.00000

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
experience         8 non-null int64
test_score         8 non-null float64
interview_score    8 non-null int64
salary             8 non-null int64
dtypes: float64(1), int64(3)
memory usage: 336.0 bytes

In [31]:
data['experience'] = pd.to_numeric(data['experience'])

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
experience         8 non-null int64
test_score         8 non-null float64
interview_score    8 non-null int64
salary             8 non-null int64
dtypes: float64(1), int64(3)
memory usage: 336.0 bytes

In [33]:
data.describe()

       experience  test_score  interview_score       salary
count     8.00000    8.000000         8.000000      8.00000
mean      4.75000    7.875000         7.875000  63000.00000
std       4.26782    1.246423         1.642081  11501.55269
min       0.00000    6.000000         6.000000  45000.00000
25%       1.50000    7.000000         6.750000  57500.00000
50%       4.00000    8.000000         7.500000  63500.00000
75%       7.75000    8.250000         9.250000  70500.00000
max      11.00000   10.000000        10.000000  80000.00000

In [34]:
import math

In [35]:
data.test_score.median()

8.0

In [36]:
data.test_score = data.test_score.fillna(data.test_score.median())
data.describe()

       experience  test_score  interview_score       salary
count     8.00000    8.000000         8.000000      8.00000
mean      4.75000    7.875000         7.875000  63000.00000
std       4.26782    1.246423         1.642081  11501.55269
min       0.00000    6.000000         6.000000  45000.00000
25%       1.50000    7.000000         6.750000  57500.00000
50%       4.00000    8.000000         7.500000  63500.00000
75%       7.75000    8.250000         9.250000  70500.00000
max      11.00000   10.000000        10.000000  80000.00000

In [37]:
from sklearn import linear_model

In [38]:
model = linear_model.LinearRegression()

In [39]:
model.fit(data[['experience','test_score','interview_score']],data.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [43]:
model.predict([[12,10,10]])

array([92002.18340611])

# Linear regression model using encoding for catergorical data

# Get Dummies method in pandas

In [21]:
import pandas as pd

In [22]:
data = pd.read_csv('C:\\users\\sameer\\Desktop\\Datasets\\carprices.csv')
data

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [23]:
data.columns

Index(['Car Model', 'Mileage', 'Sell Price($)', 'Age(yrs)'], dtype='object')

In [24]:
data.rename(columns = {'Car Model':'Car_model','Sell Price($)':'Sell_price'},inplace = True)
data.head()

  Car_model  Mileage  Sell_price  Age(yrs)
0    BMW X5    69000       18000         6
1    BMW X5    35000       34000         3
2    BMW X5    57000       26100         5
3    BMW X5    22500       40000         2
4    BMW X5    46000       31500         4

In [25]:
dummies = pd.get_dummies(data.Car_model)
dummies

    Audi A5  BMW X5  Mercedez Benz C class
0         0       1                      0
1         0       1                      0
2         0       1                      0
3         0       1                      0
4         0       1                      0
5         1       0                      0
6         1       0                      0
7         1       0                      0
8         1       0                      0
9         0       0                      1
10        0       0                      1
11        0       0                      1
12        0       0                      1

In [26]:
Merged  = pd.concat([data,dummies],axis = 'columns')
Merged

,Car_model,Mileage,Sell_price,Age(yrs),Audi A5,BMW X5,Mercedez Benz C class
0,BMW X5,69000,18000,6,0,1,0
1,BMW X5,35000,34000,3,0,1,0
2,BMW X5,57000,26100,5,0,1,0
3,BMW X5,22500,40000,2,0,1,0
4,BMW X5,46000,31500,4,0,1,0
5,Audi A5,59000,29400,5,1,0,0
6,Audi A5,52000,32000,5,1,0,0
7,Audi A5,72000,19300,6,1,0,0
8,Audi A5,91000,12000,8,1,0,0
9,Mercedez Benz C class,67000,22000,6,0,0,1
10,Mercedez Benz C class,83000,20000,7,0,0,1
11,Mercedez Benz C class,79000,21000,7,0,0,1
12,Mercedez Benz C class,59000,33000,5,0,0,1

In [28]:
final = Merged.drop(['Car_model','Audi A5'],axis = 1) # Drop 1 dummy variable, makes data redundant
final

    Mileage  Sell_price  Age(yrs)  BMW X5  Mercedez Benz C class
0     69000       18000         6       1                      0
1     35000       34000         3       1                      0
2     57000       26100         5       1                      0
3     22500       40000         2       1                      0
4     46000       31500         4       1                      0
5     59000       29400         5       0                      0
6     52000       32000         5       0                      0
7     72000       19300         6       0                      0
8     91000       12000         8       0                      0
9     67000       22000         6       0                      1
10    83000       20000         7       0                      1
11    79000       21000         7       0                      1
12    59000       33000         5       0                      1

In [29]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [33]:
X = final.drop(['Sell_price'],axis = 1)
X

    Mileage  Age(yrs)  BMW X5  Mercedez Benz C class
0     69000         6       1                      0
1     35000         3       1                      0
2     57000         5       1                      0
3     22500         2       1                      0
4     46000         4       1                      0
5     59000         5       0                      0
6     52000         5       0                      0
7     72000         6       0                      0
8     91000         8       0                      0
9     67000         6       0                      1
10    83000         7       0                      1
11    79000         7       0                      1
12    59000         5       0                      1

In [36]:
y = final.Sell_price
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell_price, dtype: int64

In [38]:
model_fit = model.fit(X,y)
model_fit

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [39]:
model.predict([[35000,3,1,0]]) # mileage,age,(1,0) for BMW -> (0,1) for Mercedes -> (0,0) for Audi

array([35286.78445645])

In [43]:
model.predict([[50000,5,0,0]])

array([31354.7123738])

In [40]:
model.score(X,y)

0.9417050937281083

# One Hot Encoder Method

In [86]:
# We need to perform label encoding first to perform onehotencoder

In [87]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [96]:
dfle = pd.read_csv('C:\\users\\sameer\\Desktop\\Datasets\\carprices.csv')
dfle

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [97]:
dfle.rename(columns = {'Car Model':'Car_model','Sell Price($)':'Sell_price'},inplace = True)
dfle.head()

  Car_model  Mileage  Sell_price  Age(yrs)
0    BMW X5    69000       18000         6
1    BMW X5    35000       34000         3
2    BMW X5    57000       26100         5
3    BMW X5    22500       40000         2
4    BMW X5    46000       31500         4

In [98]:
dfle.Car_model = le.fit_transform(dfle.Car_model) # BMW = 1, Audi = 0, Mercedes = 2
dfle

    Car_model  Mileage  Sell_price  Age(yrs)
0           1    69000       18000         6
1           1    35000       34000         3
2           1    57000       26100         5
3           1    22500       40000         2
4           1    46000       31500         4
5           0    59000       29400         5
6           0    52000       32000         5
7           0    72000       19300         6
8           0    91000       12000         8
9           2    67000       22000         6
10          2    83000       20000         7
11          2    79000       21000         7
12          2    59000       33000         5

In [107]:
train_X = dfle[['Car_model','Mileage','Age(yrs)']].values # want 'X' to be a 2D array
train_X

array([[    1, 69000,     6],
       [    1, 35000,     3],
       [    1, 57000,     5],
       [    1, 22500,     2],
       [    1, 46000,     4],
       [    0, 59000,     5],
       [    0, 52000,     5],
       [    0, 72000,     6],
       [    0, 91000,     8],
       [    2, 67000,     6],
       [    2, 83000,     7],
       [    2, 79000,     7],
       [    2, 59000,     5]], dtype=int64)

In [108]:
y = dfle.Sell_price #price
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell_price, dtype: int64

In [109]:
from sklearn.preprocessing import OneHotEncoder 
ohe = OneHotEncoder(categorical_features=[0]) # [0] is the catergorical feature in data i.e, car model

In [110]:
train_X = ohe.fit_transform(X).toarray()
train_X

C:\Users\sameer\Anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)

array([[0.00e+00, 1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [111]:
train_X = train_X[:,1:] # Droping first column
train_X

array([[1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [112]:
model.fit(train_X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [113]:
model.predict([[1,0,35000,3]]) # BMW,Mileage,age

array([35286.78445645])

In [114]:
model.predict([[0,0,50000,5]]) #Audi,Mileage,age

array([31354.7123738])

In [117]:
model.predict([[0,1,45000,4]]) # Mercedes,Mileage,age

array([36991.31721062])

In [121]:
model.score(train_X,y)

0.9417050937281082